smash> smash error: kill: invalid arguments
smash> smash error: kill: job-id -1 does not exist
smash> smash error: kill: invalid arguments
smash> smash error: kill: job-id 1 does not exist
smash> smash error: kill: invalid arguments
smash> smash error: kill: invalid arguments
smash> smash error: kill: invalid arguments
smash> smash error: kill: job-id 1 does not exist
smash> smash> smash error: kill: invalid arguments
smash> smash error: kill: invalid arguments
smash> smash error: kill: invalid arguments
smash> smash error: kill: invalid arguments
smash> smash error: kill: invalid arguments
smash> signal number 9 was sent to pid 18683
smash> smash error: kill: job-id 1 does not exist
smash> smash> smash> smash error: kill failed: Invalid argument
smash> [1] sleep 10& : 18684 1 secs
smash> smash> [1] sleep 10& : 18684 1 secs
[2] sleep 5& : 18685 0 secs
smash> smash> [1] sleep 10& : 18684 2 secs
[2] sleep 5& : 18685 1 secs
[3] sleep 3& : 18686 1 secs
smash> smash error: kill: invalid arguments
smash> smash error: kill: invalid arguments
smash> smash> smash> [1] sleep 10 & : 18687 3 secs
smash> signal number 9 was sent to pid 18687
smash> smash> smash> smash> smash: got ctrl-Z
smash: process 18690 was stopped
smash> [1] sleep 5& : 18688 1 secs
[2]           sleep        10   & : 18689 1 secs
[3] sleep 15 : 18690 0 secs (stopped)
smash> signal number 9 was sent to pid 18688
smash> [2]           sleep        10   & : 18689 1 secs
[3] sleep 15 : 18690 0 secs (stopped)
smash> signal number 9 was sent to pid 18689
smash> [3] sleep 15 : 18690 0 secs (stopped)
smash> signal number 9 was sent to pid 18690
smash> smash> smash> signal number 19 was sent to pid 18691
smash> [1] sleep 10& : 18691 3 secs
smash> smash: got ctrl-C
smash: process 18692 was killed
smash> signal number 9 was sent to pid 18691
smash> smash: sending SIGKILL signal to 0 jobs:
